FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/БюджетЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>БюджетЗакупок</Name>
			<Comment>Бюджет закупок</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество проданного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРег</Name>
					<Comment>Сумма рег.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Comment>Сценарий планирования бюджета закупок</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был зафиксирован факт продажи товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Проданный товар или оказанная услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/БюджетЗакупок/Ext/RecordSetModule.bsl
Перем ПодразделениеКомпании Экспорт; // Подразделение компании
Перем ДокументОбъект Экспорт;        // Документ объект (Регистратор)
Перем РежимПроведения Экспорт;       // Режим проведения документа оперативный/неоперативный

// Функция выполняющая приход
Функция Приход() Экспорт
	Результат=Истина;
	
	// Получим документ, по которому будем делать записи в регистр
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	БюджетЗакупокТовары.Ссылка.ПодразделениеКомпании,
	|	БюджетЗакупокТовары.Ссылка.СценарийПланирования,
	|	БюджетЗакупокТовары.Номенклатура,
	|	БюджетЗакупокТовары.Количество,
	|	БюджетЗакупокТовары.СуммаВсегоУпр КАК СуммаУпр,
	|	БюджетЗакупокТовары.СуммаВсегоУпр * &Коэффициент КАК СуммаРег,
	|	БюджетЗакупокТовары.СуммаНДС КАК СуммаНДС,
	|	БюджетЗакупокТовары.Ссылка.ДатаПланирования КАК Период
	|ИЗ
	|	Документ.БюджетЗакупок.Товары КАК БюджетЗакупокТовары
	|ГДЕ
	|	БюджетЗакупокТовары.Ссылка = &Ссылка";	
	
	// Найдем коэффициент пересчета из управленческой валюты в валюту регл.учета
	УпрВал = обКурсДляВалюты(Константы.ВалютаУправленческогоУчетаКомпании.Получить(), ДокументОбъект.Дата);
	РегВал = обКурсДляВалюты(Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(), ДокументОбъект.Дата);  	
	Коэффициент = (УпрВал.Курс/УпрВал.Кратность) / (РегВал.Курс/РегВал.Кратность);
	
	Запрос.УстановитьПараметр("Ссылка",ДокументОбъект);	
	Запрос.УстановитьПараметр("Коэффициент",Коэффициент);	

	Загрузить(Запрос.Выполнить().Выгрузить());
		
	ДокументОбъект=Неопределено;	
	Возврат Результат;
КонецФункции

// Предопределенная процедура
Процедура ПриЗаписи(Отказ, Замещение)
	
	// Зарегистрируем изменения для узлов РБД
	орРегистрацияИзменений(ЭтотОбъект);
	
КонецПроцедуры	//	ПриЗаписи()
